# Employee Database - Technical Report

In order to correctly create the table schema, it was imperative to know what columns each table contained. By knowing the columns, it was easier to identify what would be the primary key and the foreign key in each table. There were two main columns that were part of the majority of tables, emp_no and dept_no. In fact, for emp_no, the only table that did not include this column was 'departments'. 


The next step was to see what tables had emp_no or dept_no as unique values, in order to determine they could be used as primary keys in certain tables. Of the tables with the emp_no column, the following tables had unique emp_no values: 'employees', 'salaries', and 'dept_manager'. 



For dept_no, the only table that had unique values was 'departments' and therefore, dept_no became the primary key in that table. For the other two tables that had dept_no columns, 'dept_emp' and 'dept_manager', dept_no became the foreign key.In both instances, it had a one-to-many relationship between the primary key in 'departments' since dept_no was not unique in either of the two tables. Since neither emp_no or dept_no were primary keys in 'dept_emp' and 'dept_manager', id SERIAL was used as the primary key in order to create unique rows for each table.

In [32]:
import pandas as pd

# Read the CSV into a Pandas DataFrame
dept = pd.read_csv("data/departments.csv")
dept_emp = pd.read_csv("data/dept_emp.csv")
dept_manager = pd.read_csv("data/dept_manager.csv")
emp = pd.read_csv("data/employees.csv")
s = pd.read_csv("data/salaries.csv")
t = pd.read_csv("data/titles.csv")

In [45]:
dept['dept_no'].value_counts()

d001    1
d002    1
d004    1
d003    1
d005    1
d007    1
d009    1
d006    1
d008    1
Name: dept_no, dtype: int64

### To solve the bonus, two approaches were used:

(1) Creating Pandas Dataframes using read_sql

In [17]:
# Dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sqlalchemy import create_engine

In [18]:
# Create engine to import SQL into Pandas
engine = create_engine('postgresql://postgres: @localhost:5432/employee_db')
connection = engine.connect()

In [ ]:
# Create Pandas Dataframes using SQL statements
salaries = pd.read_sql('SELECT * FROM salaries', connection)
titles = pd.read_sql('SELECT * FROM "titles"', connection)

# Merge both Dataframes based on emp_no
full_df = pd.merge(titles,salaries,on='emp_no',how='inner')

In [ ]:
# Create a copy of the Dataframe
clean_df = full_df.copy()
# Select only the title and salary column
clean_df = clean_df[['title','salary']]
# Use Groupby on title and get the average salary per title
grouped_df = clean_df.groupby('title').mean()

In [ ]:
# Create a bar plot
grouped_df.plot.bar()

(2) Creating Pandas Dataframes using SQLAlchemy with automap and orm

In [19]:
# Import SQLAlchemy `automap` and other dependencies here
import pandas as pd
import matplotlib.pyplot as plt
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine

In [ ]:
# Create engine to import SQL into Pandas
engine = create_engine('postgresql://postgres: @localhost:5432/employee_db')
connection = engine.connect()

In [21]:
Base = automap_base()
Base.prepare(engine, reflect=True)
Salaries = Base.classes.salaries
Titles = Base.classes.titles

In [22]:
# Start a session to query the database
session = Session(engine)

In [29]:
stmt = session.query(Salaries,Titles).filter(Salaries.emp_no == Titles.emp_no).statement
full_df2 = pd.read_sql_query(stmt, session.bind)
clean_df2 = full_df2.copy()
clean_df2 = clean_df2[['title','salary']]
grouped_df2 = clean_df2.groupby('title').mean()
grouped_df2

                          salary
title
Assistant Engineer  48493.204786
Engineer            48539.781423
Manager             51531.041667
Senior Engineer     48506.751806
Senior Staff        58503.286614
Staff               58465.271904
Technique Leader    48580.505772

In [30]:
grouped_df

                          salary
title
Assistant Engineer  48493.204786
Engineer            48539.781423
Manager             51531.041667
Senior Engineer     48506.751806
Senior Staff        58503.286614
Staff               58465.271904
Technique Leader    48580.505772